connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/inc/tmpm46b_udmac.h
/**
 *******************************************************************************
 * @file    tmpm46b_udmac.h
 * @brief   This file provides all the functions prototypes for uDMAC driver.
 * @version V2.0.2.1
 * @date    2015/02/11
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA ELECTRONIC DEVICES & STORAGE CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __TMPM46B_uDMAC_H
#define __TMPM46B_uDMAC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "TMPM46B.h"
#include "TX04_common.h"

/** @addtogroup TX04_Periph_Driver
  * @{
  */

/** @addtogroup uDMAC
  * @{
  */

/** @defgroup uDMAC_Exported_Constants
  * @{
  */
#define DMAC_UNIT_A  TSB_DMAA   /* redefine the name in m46b.h */
#define DMAC_UNIT_B  TSB_DMAB
#define DMAC_UNIT_C  TSB_DMAC
#define IS_DMAC_UNIT(param)              (((param) == DMAC_UNIT_A) || \
                                          ((param) == DMAC_UNIT_B) || \
                                          ((param) == DMAC_UNIT_C))

/** @} */
/* End of group uDMAC_Exported_Constants */

/** @defgroup uDMAC_Exported_Types
  * @{
  */

/*-------------------------DMACA  channels----------------------------------*/
#define DMACA_SNFC_PRD11                   ((uint8_t)0x00)
#define DMACA_SNFC_PRD12                   ((uint8_t)0x01)
#define DMACA_SNFC_PRD21                   ((uint8_t)0x02)
#define DMACA_SNFC_PRD22                   ((uint8_t)0x03)
#define DMACA_ADC_COMPLETION               ((uint8_t)0x04)
#define DMACA_UART0_RX                     ((uint8_t)0x05)
#define DMACA_UART0_TX                     ((uint8_t)0x06)
#define DMACA_UART1_RX                     ((uint8_t)0x07)
#define DMACA_UART1_TX                     ((uint8_t)0x08)
#define DMACA_SIO0_UART0_RX                ((uint8_t)0x09)
#define DMACA_SIO0_UART0_TX                ((uint8_t)0x0A)
#define DMACA_SIO1_UART1_RX                ((uint8_t)0x0B)
#define DMACA_SIO1_UART1_TX                ((uint8_t)0x0C)
#define DMACA_SIO2_UART2_RX                ((uint8_t)0x0D)
#define DMACA_SIO2_UART2_TX                ((uint8_t)0x0E)
#define DMACA_SIO3_UART3_RX                ((uint8_t)0x0F)
#define DMACA_SIO3_UART3_TX                ((uint8_t)0x10)
#define DMACA_TMRB0_CMP_MATCH              ((uint8_t)0x11)
#define DMACA_TMRB1_CMP_MATCH              ((uint8_t)0x12)
#define DMACA_TMRB2_CMP_MATCH              ((uint8_t)0x13)
#define DMACA_TMRB3_CMP_MATCH              ((uint8_t)0x14)
#define DMACA_TMRB4_CMP_MATCH              ((uint8_t)0x15)
#define DMACA_TMRB5_CMP_MATCH              ((uint8_t)0x16)
#define DMACA_TMRB6_CMP_MATCH              ((uint8_t)0x17)
#define DMACA_TMRB7_CMP_MATCH              ((uint8_t)0x18)
#define DMACA_TMRB0_INPUT_CAP0             ((uint8_t)0x19)
#define DMACA_TMRB0_INPUT_CAP1             ((uint8_t)0x1A)
#define DMACA_TMRB1_INPUT_CAP0             ((uint8_t)0x1B)
#define DMACA_TMRB1_INPUT_CAP1             ((uint8_t)0x1C)
#define DMACA_TMRB2_INPUT_CAP0             ((uint8_t)0x1D)
#define DMACA_TMRB2_INPUT_CAP1             ((uint8_t)0x1E)
#define DMACA_DMAREQA                      ((uint8_t)0x1F)
#define IS_DMACA_CHANNEL_ALL(param)        ((param) <= DMACA_DMAREQA)
#define IS_DMACA_CHANNEL_SINGLE(param)    (((param) >= DMACA_UART0_RX) && ((param) <= DMACA_UART1_TX))

/*-------------------------DMACB  channels----------------------------------*/
#define DMACB_SNFC_GIE1                    ((uint8_t)0x00)
#define DMACB_SNFC_GIE2                    ((uint8_t)0x01)
#define DMACB_SNFC_GIE3                    ((uint8_t)0x02)
#define DMACB_SNFC_GIE4                    ((uint8_t)0x03)
#define DMACB_SNFC_GIE5                    ((uint8_t)0x04)
#define DMACB_SNFC_GIE6                    ((uint8_t)0x05)
#define DMACB_SNFC_GIE7                    ((uint8_t)0x06)
#define DMACB_SNFC_GIE8                    ((uint8_t)0x07)
#define DMACB_SNFC_GID11                   ((uint8_t)0x08)
#define DMACB_SNFC_GID12                   ((uint8_t)0x09)
#define DMACB_SNFC_GID13                   ((uint8_t)0x0A)
#define DMACB_SNFC_GID14                   ((uint8_t)0x0B)
#define DMACB_SNFC_GID15                   ((uint8_t)0x0C)
#define DMACB_SNFC_GID16                   ((uint8_t)0x0D)
#define DMACB_SNFC_GID17                   ((uint8_t)0x0E)
#define DMACB_SNFC_GID18                   ((uint8_t)0x0F)
#define DMACB_SNFC_GID21                   ((uint8_t)0x10)
#define DMACB_SNFC_GID22                   ((uint8_t)0x11)
#define DMACB_SNFC_GID23                   ((uint8_t)0x12)
#define DMACB_SNFC_GID24                   ((uint8_t)0x13)
#define DMACB_SNFC_GID25                   ((uint8_t)0x14)
#define DMACB_SNFC_GID26                   ((uint8_t)0x15)
#define DMACB_SNFC_GID27                   ((uint8_t)0x16)
#define DMACB_SNFC_GID28                   ((uint8_t)0x17)
#define DMACB_ADC_COMPLETION               ((uint8_t)0x18)
#define DMACB_SSP0_RX                      ((uint8_t)0x19)
#define DMACB_SSP0_TX                      ((uint8_t)0x1A)
#define DMACB_SSP1_RX                      ((uint8_t)0x1B)
#define DMACB_SSP1_TX                      ((uint8_t)0x1C)
#define DMACB_SSP2_RX                      ((uint8_t)0x1D)
#define DMACB_SSP2_TX                      ((uint8_t)0x1E)
#define DMACB_DMAREQB                      ((uint8_t)0x1F)
#define IS_DMACB_CHANNEL_ALL(param)        ((param) <= DMACB_DMAREQB)
#define IS_DMACB_CHANNEL_SINGLE(param)    (((param) >= DMACB_SSP0_RX) && ((param) <= DMACB_SSP2_TX))

/*-------------------------DMACC  channels----------------------------------*/
#define DMACC_SNFC_RD1                     ((uint8_t)0x00)
#define DMACC_SNFC_RD2                     ((uint8_t)0x01)
#define DMACC_SNFC_RD3                     ((uint8_t)0x02)
#define DMACC_SNFC_RD4                     ((uint8_t)0x03)
#define DMACC_SNFC_RD5                     ((uint8_t)0x04)
#define DMACC_SNFC_RD6                     ((uint8_t)0x05)
#define DMACC_SNFC_RD7                     ((uint8_t)0x06)
#define DMACC_SNFC_RD8                     ((uint8_t)0x07)
#define DMACC_AES_READ                     ((uint8_t)0x08)
#define DMACC_AES_WRITE                    ((uint8_t)0x09)
#define DMACC_SHA_WRITE                    ((uint8_t)0x0A)
#define DMACC_DMA_COMPLETION               ((uint8_t)0x0B)
#define DMACC_I2C0_TX_RX                   ((uint8_t)0x0C)
#define DMACC_I2C1_TX_RX                   ((uint8_t)0x0D)
#define DMACC_I2C2_TX_RX                   ((uint8_t)0x0E)
#define DMACC_MTP0_CMP_MATCH0              ((uint8_t)0x0F)
#define DMACC_MTP0_CMP_MATCH1              ((uint8_t)0x10)
#define DMACC_MTP1_CMP_MATCH0              ((uint8_t)0x11)
#define DMACC_MTP1_CMP_MATCH1              ((uint8_t)0x12)
#define DMACC_MTP2_CMP_MATCH0              ((uint8_t)0x13)
#define DMACC_MTP2_CMP_MATCH1              ((uint8_t)0x14)
#define DMACC_MTP3_CMP_MATCH0              ((uint8_t)0x15)
#define DMACC_MTP3_CMP_MATCH1              ((uint8_t)0x16)
#define DMACC_TMRB3_INPUT_CAP0             ((uint8_t)0x17)
#define DMACC_TMRB3_INPUT_CAP1             ((uint8_t)0x18)
#define DMACC_TMRB4_INPUT_CAP0             ((uint8_t)0x19)
#define DMACC_TMRB4_INPUT_CAP1             ((uint8_t)0x1A)
#define DMACC_TMRB5_INPUT_CAP0             ((uint8_t)0x1B)
#define DMACC_TMRB5_INPUT_CAP1             ((uint8_t)0x1C)
#define DMACC_TMRB6_INPUT_CAP0             ((uint8_t)0x1D)
#define DMACC_TMRB6_INPUT_CAP1             ((uint8_t)0x1E)
#define DMACC_DMAREQC                      ((uint8_t)0x1F)

#define IS_DMAC_CHANNEL_ALL(param1,param2) ((((param1) == DMAC_UNIT_A) && ((param2) <= DMACA_DMAREQA)) || \
                                            (((param1) == DMAC_UNIT_B) && ((param2) <= DMACB_DMAREQB)) || \
                                            (((param1) == DMAC_UNIT_C) && ((param2) <= DMACC_DMAREQC)))

