connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/inc/tmpm46b_udmac.h
    typedef enum {
        DMAC_PRIMARY = 0U,
        DMAC_ALTERNATE = 1U
    } DMAC_PrimaryAlt;
#define IS_DMAC_PRIMARYALT(param)         ((param) <= DMAC_ALTERNATE)
#define IS_DMAC_CTRL_BASE(param)          (((param) & (uint32_t)0x000003FF) == (uint32_t)0x00000000)

    typedef enum {
        DMAC_SINGLE = 0U,
        DMAC_BURST = 1U
    } DMAC_TransferType;
#define IS_DMAC_TRANSFERTYPE(param)       ((param) <= DMAC_BURST)

    typedef enum {
        DMAC_PRIORITY_NORMAL = 0U,
        DMAC_PRIORITY_HIGH = 1U
    } DMAC_Priority;
#define IS_DMAC_PRIORITY(param)           ((param) <= DMAC_PRIORITY_HIGH)

    typedef enum {
        DMAC_BYTE = 0U,         /* Data size of transfer is 1 byte */
        DMAC_HALF_WORD = 1U,    /* Data size of transfer is 2 bytes */
        DMAC_WORD = 2U          /* Data size of transfer is 4 bytes */
    } DMAC_BitWidth;
#define IS_DMAC_BIT_WIDTH(param)          ((param) <= DMAC_WORD)

    typedef enum {
        DMAC_INC_1B = 0U,       /* Address increment 1 byte */
        DMAC_INC_2B = 1U,       /* Address increment 2 bytes */
        DMAC_INC_4B = 2U,       /* Address increment 4 bytes */
        DMAC_INC_0B = 3U        /* Address does not increase */
    } DMAC_IncWidth;
#define IS_DMAC_INCWIDTH(param)           ((param) <= DMAC_INC_0B)
#define IS_DMAC_INCWIDTH_VALID(bitwidth, incwidth)     ((bitwidth) <= (incwidth))

    typedef enum {
        DMAC_INVALID = 0U,
        DMAC_BASIC = 1U,
        DMAC_AUTOMATIC = 2U,
        DMAC_PINGPONG = 3U,
        DMAC_MEM_SCATTER_GATHER_PRI = 4U,       /* Memory scatter/gather mode (primary data) */
        DMAC_MEM_SCATTER_GATHER_ALT = 5U,       /* Memory scatter/gather mode (alternative data) */
        DMAC_PERI_SCATTER_GATHER_PRI = 6U,      /* Peripheral scatter/gather mode (primary data) */
        DMAC_PERI_SCATTER_GATHER_ALT = 7U       /* Peripheral scatter/gather mode (alternative data) */
    } DMAC_CycleCtrl;
#define IS_DMAC_CYCLECTRL(param)          ((param) <= DMAC_PERI_SCATTER_GATHER_ALT)

    typedef enum {
        DMAC_NEXT_NOT_USE_BURST = 0U,
        DMAC_NEXT_USE_BURST = 1U
    } DMAC_Next_UseBurst;
#define IS_DMAC_NEXT_USEBURST(param)      ((param) <= DMAC_NEXT_USE_BURST)

    typedef enum {
        DMAC_AFTER_1_TX = 0U,   /* Arbitration after one transfer */
        DMAC_AFTER_2_TX = 1U,   /* Arbitration after two transfer */
        DMAC_AFTER_4_TX = 2U,
        DMAC_AFTER_8_TX = 3U,
        DMAC_AFTER_16_TX = 4U,
        DMAC_AFTER_32_TX = 5U,
        DMAC_AFTER_64_TX = 6U,
        DMAC_AFTER_128_TX = 7U,
        DMAC_AFTER_256_TX = 8U,
        DMAC_AFTER_512_TX = 9U, /* Arbitration after 512 transfer */
        DMAC_NEVER = 10U        /* Do not arbitration */
    } DMAC_Arbitration;
#define IS_DMAC_ARBITRATION(param)        ((param) <= DMAC_NEVER)

#define IS_DMAC_TXNUM(param)              ((param) <= 1024U)

/** 
  * @brief  Union to store DMA UINTA interrupt
  */
    typedef union {
        uint32_t All;
        struct {
            uint32_t SNFC_PRD11:1;              /*!< Bit0, the flag of SNFC_PRD11 occurs an interrupt */
            uint32_t SNFC_PRD12:1;              /*!< Bit1, the flag of SNFC_PRD12 occurs an interrupt */
            uint32_t SNFC_PRD21:1;              /*!< Bit2, the flag of SNFC_PRD21 occurs an interrupt */
            uint32_t SNFC_PRD22:1;              /*!< Bit3, the flag of SNFC_PRD22 occurs an interrupt */
            uint32_t ADCCompletion:1;           /*!< Bit4, the flag of ADC completion occurs an interrupt */
            uint32_t UART0Reception:1;          /*!< Bit5, the flag of UART0 reception occurs an interrupt */
            uint32_t UART0Transmission:1;       /*!< Bit6, the flag of UART0 transmission occurs an interrupt */
            uint32_t UART1Reception:1;          /*!< Bit7, the flag of UART1 reception occurs an interrupt */
            uint32_t UART1Transmission:1;       /*!< Bit8, the flag of UART1 transmission occurs an interrupt */
            uint32_t SIO_UART0Reception:1;      /*!< Bit9, the flag of SIO/UART0 reception occurs an interrupt */
            uint32_t SIO_UART0Transmission:1;   /*!< Bit10, the flag of SIO/UART0 transmission occurs an interrupt */
            uint32_t SIO_UART1Reception:1;      /*!< Bit11, the flag of SIO/UART1 reception occurs an interrupt */
            uint32_t SIO_UART1Transmission:1;   /*!< Bit12, the flag of SIO/UART1 transmission occurs an interrupt */
            uint32_t SIO_UART2Reception:1;      /*!< Bit13, the flag of SIO/UART2 reception occurs an interrupt */
            uint32_t SIO_UART2Transmission:1;   /*!< Bit14, the flag of SIO/UART2 transmission occurs an interrupt */
            uint32_t SIO_UART3Reception:1;      /*!< Bit15, the flag of SIO/UART3 reception occurs an interrupt */
            uint32_t SIO_UART3Transmission:1;   /*!< Bit16, the flag of SIO/UART3 transmission occurs an interrupt */
            uint32_t TMRB0CompareMatch:1;       /*!< Bit17, the flag of TMRB0 compare match occurs an interrupt */
            uint32_t TMRB1CompareMatch:1;       /*!< Bit18, the flag of TMRB1 compare match occurs an interrupt */
            uint32_t TMRB2CompareMatch:1;       /*!< Bit19, the flag of TMRB2 compare match occurs an interrupt */
            uint32_t TMRB3CompareMatch:1;       /*!< Bit20, the flag of TMRB3 compare match occurs an interrupt */
            uint32_t TMRB4CompareMatch:1;       /*!< Bit21, the flag of TMRB4 compare match occurs an interrupt */
            uint32_t TMRB5CompareMatch:1;       /*!< Bit22, the flag of TMRB5 compare match occurs an interrupt */
            uint32_t TMRB6CompareMatch:1;       /*!< Bit23, the flag of TMRB6 compare match occurs an interrupt */
            uint32_t TMRB7CompareMatch:1;       /*!< Bit24, the flag of TMRB7 compare match occurs an interrupt */
            uint32_t TMRB0InputCapture0:1;      /*!< Bit25, the flag of TMRB0 input capture 0 occurs an interrupt */
            uint32_t TMRB0InputCapture1:1;      /*!< Bit26, the flag of TMRB0 input capture 1 occurs an interrupt */
            uint32_t TMRB1InputCapture0:1;      /*!< Bit27, the flag of TMRB1 input capture 0 occurs an interrupt */
            uint32_t TMRB1InputCapture1:1;      /*!< Bit28, the flag of TMRB1 input capture 1 occurs an interrupt */
            uint32_t TMRB2InputCapture0:1;      /*!< Bit29, the flag of TMRB2 input capture 0 occurs an interrupt */
            uint32_t TMRB2InputCapture1:1;      /*!< Bit30, the flag of TMRB2 input capture 1 occurs an interrupt */
            uint32_t DMAREQA:1;                 /*!< Bit31, the flag of pin DMAREQA occurs an interrupt */
        } Bit;
    } DMACA_Flag;

/** 
  * @brief  Union to store DMA UINTB interrupt
  */
    typedef union {
        uint32_t All;
        struct {
            uint32_t SNFC_GIE1:1;               /*!< Bit0, the flag of SNFC_GIE1 occurs an interrupt */
            uint32_t SNFC_GIE2:1;               /*!< Bit1, the flag of SNFC_GIE2 occurs an interrupt */
            uint32_t SNFC_GIE3:1;               /*!< Bit2, the flag of SNFC_GIE3 occurs an interrupt */
            uint32_t SNFC_GIE4:1;               /*!< Bit3, the flag of SNFC_GIE4 occurs an interrupt */
            uint32_t SNFC_GIE5:1;               /*!< Bit4, the flag of SNFC_GIE5 occurs an interrupt */
            uint32_t SNFC_GIE6:1;               /*!< Bit5, the flag of SNFC_GIE6 occurs an interrupt */
            uint32_t SNFC_GIE7:1;               /*!< Bit6, the flag of SNFC_GIE7 occurs an interrupt */
            uint32_t SNFC_GIE8:1;               /*!< Bit7, the flag of SNFC_GIE8 occurs an interrupt */
            uint32_t SNFC_GID11:1;              /*!< Bit8, the flag of SNFC_GID11 occurs an interrupt */
            uint32_t SNFC_GID12:1;              /*!< Bit9, the flag of SNFC_GID12 occurs an interrupt */
            uint32_t SNFC_GID13:1;              /*!< Bit10, the flag of SNFC_GID13 occurs an interrupt */
            uint32_t SNFC_GID14:1;              /*!< Bit11, the flag of SNFC_GID14 occurs an interrupt */
            uint32_t SNFC_GID15:1;              /*!< Bit12, the flag of SNFC_GID15 occurs an interrupt */
            uint32_t SNFC_GID16:1;              /*!< Bit13, the flag of SNFC_GID16 occurs an interrupt */
            uint32_t SNFC_GID17:1;              /*!< Bit14, the flag of SNFC_GID17 occurs an interrupt */
            uint32_t SNFC_GID18:1;              /*!< Bit15, the flag of SNFC_GID18 occurs an interrupt */
            uint32_t SNFC_GID21:1;              /*!< Bit16, the flag of SNFC_GID21 occurs an interrupt */
            uint32_t SNFC_GID22:1;              /*!< Bit17, the flag of SNFC_GID22 occurs an interrupt */
            uint32_t SNFC_GID23:1;              /*!< Bit18, the flag of SNFC_GID23 occurs an interrupt */
            uint32_t SNFC_GID24:1;              /*!< Bit19, the flag of SNFC_GID24 occurs an interrupt */
            uint32_t SNFC_GID25:1;              /*!< Bit20, the flag of SNFC_GID25 occurs an interrupt */
            uint32_t SNFC_GID26:1;              /*!< Bit21, the flag of SNFC_GID26 occurs an interrupt */
            uint32_t SNFC_GID27:1;              /*!< Bit22, the flag of SNFC_GID27 occurs an interrupt */
            uint32_t SNFC_GID28:1;              /*!< Bit23, the flag of SNFC_GID28 occurs an interrupt */
            uint32_t ADCCompletion:1;           /*!< Bit24, the flag of ADC completion occurs an interrupt */
            uint32_t SSP0Reception:1;           /*!< Bit25, the flag of SSP0 reception occurs an interrupt */
            uint32_t SSP0Transmission:1;        /*!< Bit26, the flag of SSP0 transmission occurs an interrupt */
            uint32_t SSP1Reception:1;           /*!< Bit27, the flag of SSP1 reception occurs an interrupt */
            uint32_t SSP1Transmission:1;        /*!< Bit28, the flag of SSP1 transmission occurs an interrupt */
            uint32_t SSP2Reception:1;           /*!< Bit29, the flag of SSP2 reception occurs an interrupt */
            uint32_t SSP2Transmission:1;        /*!< Bit30, the flag of SSP2 transmission occurs an interrupt */
            uint32_t DMAREQB:1;                 /*!< Bit31, the flag of pin DMAREQB occurs an interrupt */
        } Bit;
    } DMACB_Flag;

/** 
  * @brief  Union to store DMA UINTC interrupt
  */
    typedef union {
        uint32_t All;
        struct {
            uint32_t SNFC_RD1:1;                /*!< Bit0, the flag of SNFC_RD1 occurs an interrupt */
            uint32_t SNFC_RD2:1;                /*!< Bit1, the flag of SNFC_RD2 occurs an interrupt */
            uint32_t SNFC_RD3:1;                /*!< Bit2, the flag of SNFC_RD3 occurs an interrupt */
            uint32_t SNFC_RD4:1;                /*!< Bit3, the flag of SNFC_RD4 occurs an interrupt */
            uint32_t SNFC_RD5:1;                /*!< Bit4, the flag of SNFC_RD5 occurs an interrupt */
            uint32_t SNFC_RD6:1;                /*!< Bit5, the flag of SNFC_RD6 occurs an interrupt */
            uint32_t SNFC_RD7:1;                /*!< Bit6, the flag of SNFC_RD7 occurs an interrupt */
            uint32_t SNFC_RD8:1;                /*!< Bit7, the flag of SNFC_RD8 occurs an interrupt */
            uint32_t AESRead:1;                 /*!< Bit8, the flag of AES read occurs an interrupt */
            uint32_t AESWrite:1;                /*!< Bit9, the flag of AES write occurs an interrupt */
            uint32_t SHAWrite:1;                /*!< Bit10, the flag of SHA write occurs an interrupt */
            uint32_t DMACompletion:1;           /*!< Bit11, the flag of DMA completion occurs an interrupt */
            uint32_t I2C0RxorTx:1;              /*!< Bit12, the flag of I2C0 reception/transmission occurs an interrupt */
            uint32_t I2C1RxorTx:1;              /*!< Bit13, the flag of I2C1 reception/transmission occurs an interrupt */
            uint32_t I2C2RxorTx:1;              /*!< Bit14, the flag of I2C2 reception/transmission occurs an interrupt */
            uint32_t MTP0CompareMatch0:1;       /*!< Bit15, the flag of MTP0 compare match 0 occurs an interrupt */
            uint32_t MTP0CompareMatch1:1;       /*!< Bit16, the flag of MTP0 compare match 1 occurs an interrupt */
            uint32_t MTP1CompareMatch0:1;       /*!< Bit17, the flag of MTP1 compare match 0 occurs an interrupt */
            uint32_t MTP1CompareMatch1:1;       /*!< Bit18, the flag of MTP1 compare match 1 occurs an interrupt */
            uint32_t MTP2CompareMatch0:1;       /*!< Bit19, the flag of MTP2 compare match 0 occurs an interrupt */
            uint32_t MTP2CompareMatch1:1;       /*!< Bit20, the flag of MTP2 compare match 1 occurs an interrupt */
            uint32_t MTP3CompareMatch0:1;       /*!< Bit21, the flag of MTP3 compare match 0 occurs an interrupt */
            uint32_t MTP3CompareMatch1:1;       /*!< Bit22, the flag of MTP3 compare match 1 occurs an interrupt */
            uint32_t TMRB3InputCapture0:1;      /*!< Bit23, the flag of TMRB3 input capture 0 occurs an interrupt */
            uint32_t TMRB3InputCapture1:1;      /*!< Bit24, the flag of TMRB3 input capture 1 occurs an interrupt */
            uint32_t TMRB4InputCapture0:1;      /*!< Bit25, the flag of TMRB4 input capture 0 occurs an interrupt */
            uint32_t TMRB4InputCapture1:1;      /*!< Bit26, the flag of TMRB4 input capture 1 occurs an interrupt */
            uint32_t TMRB5InputCapture0:1;      /*!< Bit27, the flag of TMRB5 input capture 0 occurs an interrupt */
            uint32_t TMRB5InputCapture1:1;      /*!< Bit28, the flag of TMRB5 input capture 1 occurs an interrupt */
            uint32_t TMRB6InputCapture0:1;      /*!< Bit29, the flag of TMRB6 input capture 0 occurs an interrupt */
            uint32_t TMRB6InputCapture1:1;      /*!< Bit30, the flag of TMRB6 input capture 1 occurs an interrupt */
            uint32_t DMAREQC:1;                 /*!< Bit31, the flag of pin DMAREQC occurs an interrupt */
        } Bit;
    } DMACC_Flag;

/** 
  * @brief  DMA Structure definition  
  */
    typedef struct {
        uint32_t SrcEndPointer; /*!< The final address of source */
        uint32_t DstEndPointer; /*!< The final address of destination */
        DMAC_CycleCtrl Mode;    /*!< Set operation mode */
        DMAC_Next_UseBurst NextUseBurst;
        uint32_t TxNum;         /*!< Set the actual number of transfers. max is 1024 */
        DMAC_Arbitration ArbitrationMoment;     /*!< Specifies the arbitration moment(R_Power)  */
        DMAC_BitWidth SrcWidth; /*!< Set source bit width */
        DMAC_IncWidth SrcInc;   /*!< Set increment of the source address */
        DMAC_BitWidth DstWidth; /*!< Set destination bit width */
        DMAC_IncWidth DstInc;   /*!< Set increment of the destination address */
    } DMAC_InitTypeDef;

/** @} */
/* End of group uDMAC_Exported_Types */

