connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/inc/tmpm46b_udmac.h
/** @defgroup uDMAC_Exported_FunctionPrototypes
  * @{
  */
    FunctionalState DMAC_GetDMACState(TSB_DMA_TypeDef * DMACx);
    void DMAC_Enable(TSB_DMA_TypeDef * DMACx);
    void DMAC_Disable(TSB_DMA_TypeDef * DMACx);
    void DMAC_SetPrimaryBaseAddr(TSB_DMA_TypeDef * DMACx, uint32_t Addr);
    uint32_t DMAC_GetBaseAddr(TSB_DMA_TypeDef * DMACx, DMAC_PrimaryAlt PriAlt);
    void DMAC_SetSWReq(TSB_DMA_TypeDef * DMACx, uint8_t Channel);
    void DMACA_SetTransferType(uint8_t Channel, DMAC_TransferType Type);   
    DMAC_TransferType DMACA_GetTransferType(uint8_t Channel);
    void DMACB_SetTransferType(uint8_t Channel, DMAC_TransferType Type);
    DMAC_TransferType DMACB_GetTransferType(uint8_t Channel);
    void DMAC_SetMask(TSB_DMA_TypeDef * DMACx, uint8_t Channel, FunctionalState NewState);
    FunctionalState DMAC_GetMask(TSB_DMA_TypeDef * DMACx, uint8_t Channel);
    void DMAC_SetChannel(TSB_DMA_TypeDef * DMACx, uint8_t Channel, FunctionalState NewState);
    FunctionalState DMAC_GetChannelState(TSB_DMA_TypeDef * DMACx, uint8_t Channel);
    void DMAC_SetPrimaryAlt(TSB_DMA_TypeDef * DMACx, uint8_t Channel, DMAC_PrimaryAlt PriAlt);
    DMAC_PrimaryAlt DMAC_GetPrimaryAlt(TSB_DMA_TypeDef * DMACx, uint8_t Channel);
    void DMAC_SetChannelPriority(TSB_DMA_TypeDef * DMACx, uint8_t Channel, DMAC_Priority Priority);
    DMAC_Priority DMAC_GetChannelPriority(TSB_DMA_TypeDef * DMACx, uint8_t Channel);
    void DMAC_ClearBusErr(TSB_DMA_TypeDef * DMACx);
    Result DMAC_GetBusErrState(TSB_DMA_TypeDef * DMACx);
    void DMAC_FillInitData(TSB_DMA_TypeDef * DMACx, uint8_t Channel, DMAC_InitTypeDef * InitStruct);
    DMACA_Flag DMACA_GetINTFlag(void);
    DMACB_Flag DMACB_GetINTFlag(void);
    DMACC_Flag DMACC_GetINTFlag(void);
/** @} */
/* End of group uDMAC_Exported_FunctionPrototype */

/** @} */
/* End of group uDMAC */

/** @} */
/* End of group TX04_Periph_Driver */

#ifdef __cplusplus
}
#endif                          /* __cplusplus */
#endif                          /* __TMPM46B_uDMAC_H */
